// 회원 :  개인정보 관련 내용
const TERMS_PRIVACY = {
  title: '아이스크림 킨더보드 개인정보처리방침',
  contentItem: [
    {
      contents: [
        `㈜아이스크림미디어가 운영하는 아이스크림 킨더보드에서 취급하는 이용자의 모든 개인정보는 관련법령에 근거하거나 이용자의 동의하에 수집, 보유 및 처리, 관리 되고 있습니다.`,
        `[개인정보 보호법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률]은 이러한 개인정보처리에 대한 일반적인 규범을 제시하고 있으며, ㈜아이스크림미디어(이하 회사)에서는 이러한 법령의 규정에 따라 수집, 보유 및 처리, 관리하는 개인정보를 이용약관에 명시한 목적 이외의 용도로는 절대 사용하지 않을 것이며, 외부 유출이 되지 않도록 다음과 같이 개인정보처리방침을 운영하고 있습니다.`,
      ],
    },
    {
      title: '개인정보 수집',
      contents: [['이름, 휴대폰 번호 등 세부내용 본문 확인']],
    },
    {
      title: '개인정보 보유 기간',
      contents: [['회원 탈퇴 시 까지']],
    },
    {
      title: '개인정보 처리 목적',
      contents: [['회원관리 서비스 제공 등 세부내용 본문 확인']],
    },
    {
      title: '고충처리부서',
      contents: [['아이스크림미디어 고객센터 1811-0910']],
    },
    {
      title: '1. 개인정보의 수집 및 이용 목적',
      contents: [
        '회사는 다음의 목적을 위해 개인정보를 수집 및 이용합니다.',

        [
          `회원 관리`,
          [
            `<span class="txt-bullet">-</span>회원제 서비스 이용에 따른 회원식별`,
            `<span class="txt-bullet">-</span>비인가 회원 사용 방지, 중복 가입 방지`,
            `<span class="txt-bullet">-</span>고객상담, 고객불만 접수 및 분쟁조정을 위한 기록 보존`,
            `<span class="txt-bullet">-</span>고지사항 전달`,
          ],
        ],
        [
          `반 등록 및 아이 등록`,
          [
            `<span class="txt-bullet">-</span>반 또는 아이 정보 등록`,
            `<span class="txt-bullet">-</span>아이별 사진 분류 서비스의 이용`,
            `<span class="txt-bullet">-</span>스마트 폴더링 서비스의 이용`,
            `<span class="txt-bullet">-</span>아이관찰기록 서비스의 이용`,
          ],
        ],
        [
          `서비스 제공에 관한 계약의 이행`,
          [`<span class="txt-bullet">-</span>콘텐츠 제공, 이벤트 결과 안내 및 상품배송`],
        ],
        [
          `마케팅 및 광고에 활용`,
          [
            `<span class="txt-bullet">-</span>회원에게 최적화된 서비스 제공`,
            `<span class="txt-bullet">-</span>웹페이지 접속 및 빈도 파악`,
            `<span class="txt-bullet">-</span>회원별 콘텐츠 및 서비스 이용현황 파악`,
            `<span class="txt-bullet">-</span>이벤트 광고성 정보 전달 또는 회원 참여공간 운영`,
            `<span class="txt-bullet">-</span>회원 대상 설문조사`,
          ],
        ],
      ],
    },
    {
      title: '2. 개인정보 항목 및 수집 방법',
      contents: [
        `<span>1) 수집이용 항목</span>`,
        [
          `<span>회원가입</span>`,
          [
            `<span class="txt-bullet">-</span>필수 정보 : 휴대폰번호, PW`,
            `<span class="txt-bullet">-</span>선택 정보 : 프로필 사진, 이메일, 근무 지역, 기관명, 직업`,
          ],
        ],
        [`<span>반 등록</span>`, [`<span class="txt-bullet">-</span>선택 정보 : 반 이름, 연도, 연령`]],
        [
          `<span>아이 등록</span>`,
          [`<span class="txt-bullet">-</span>선택 정보 : 이름, 나이, 성별, 생년월인, 재원여부, 프로필 사진`],
        ],
        `자동으로 수집·저장되는 개인정보 : “회원”의 인터넷 서버 도메인과 홈페이지를 방문할 때 거친 웹사이트 주소, 브라우저 종류, OS, 어플리케이션 디바이스 정보, 방문 일시, IP, 쿠키, ADID/IDFA 광고 식별자 (자동 수집·저장되는 정보는 원활한 서비스를 위해 통계분석 등에 이용 될 수 있습니다.)`,
        `<span>2) 수집 방법</span>`,
        [`회원가입 및 서비스 이용 시 웹사이트 및 앱을 통한 수집`, `자동 수집 장치를 통한 수집 (쿠키, 로그 분석 등)`],
      ],
    },
    {
      title: '3. 개인정보의 보유 및 이용 기간',
      contents: [
        `아이스크림 킨더보드 서비스를 이용하는 이용자로 있는 동안 개인정보를 보유하며, 탈퇴 시 파기합니다. 단, 필요에 따라 회사의 중대 손실 예방, 범죄 및 소송 등을 위해 최소한의 개인정보 항목을 탈퇴자의 동의를 받고 보유할 수 있으며 기타 법령의 규정에 따라 보존할 수 있습니다.`,
        `<span>1) 관련법령에 의한 정보보유 사유</span>`,
        `<span>전자상거래 등에서의 소비자 보호에 관한 법률</span>`,
        [
          `계약 또는 청약철회 등에 관한 기록 : 5년`,
          `대금결제 및 재화 등의 공급에 관한 기록 : 5년`,
          `소비자의 불만 또는 분쟁처리에 관한 기록 : 3년`,
        ],
        `<span>2) 회사 내부 방침에 따른 정보보유 사유</span>`,
        [
          `회원탈퇴 및 부득이한 이유로 가입철회 시 동일한 아이디로 재가입하는 것을 방지하기 위해, 아이디를 다른 개인정보와 별도로 분리하여 보관합니다.`,
        ],
      ],
    },
    {
      title: '4. 개인정보의 제3자 제공',
      contents: [
        `아이스크림 킨더보드는 이용자의 개인정보를 ‘개인정보의 수집 및 이용 목적, 수집하는 개인정보의 항목 및 수집 방법’에서 고지한 범위 내에서 이용하며, 동 범위를 초과하여 이용하거나 타인 또는 타기업, 기관에 제공하지 않습니다. 단, 이용자가 사전에 동의하거나 관계법률에서 정한 절차와 방법에 따라 수사기관이 개인정보 제공을 요구하는 경우 또는 영업의 양수로 인해 부득이하게 개인정보 이전이 필요한 경우(별도 이용자 사전 공지)는 별도로 제외됩니다.`,
        [
          `이용자가 사전에 동의한 경우`,
          `법률 또는 기타 다른 법률에 특별한 규정이 있는 경우`,
          `요금 정산에 필요한 경우`,
          `통계작성/학술연구 또는 시장조사를 위하여 특정개인을 식별할 수 없는 형태로 제공하는 경우`,
        ],
      ],
    },
    {
      title: '5. 이용자의 권리 및 의무',
      contents: [
        [
          `이용자는 언제든지 개인정보의 열람 및 수정이 가능하며, 개인정보 이용에 대한 동의 철회를 위하여 탈퇴가 가능합니다. (탈퇴 이후 개인정보 보존과 재가입에 대해 운영자에게 문의 주시면 자세한 설명을 드립니다.)<br/>※ 만 14세 미만 아동에 관한 개인정보의 열람등 요구는 법정대리인이 직접 해야 하며, 만 14세 이상의 미성년자인 정보주체는 정보주체의 개인정보에 관하여 미성년자 본인이 권리를 행사하거나 법정대리인을 통하여 권리를 행사할 수도 있습니다.`,
          `이용자가 개인정보의 오류에 대한 정정을 요청한 경우, 정정을 완료하기 전까지 해당 개인정보를 이용 또는 제공하지 않습니다. 또한 잘못된 개인정보를 제3자에게 이미 제공한 경우에는 정정 처리결과를 제3자에게 지체 없이 통지하여 정정이 이루어지도록 하겠습니다.`,
          `개인정보는 홈페이지의 [프로필]-[내 정보 관리] 항목 또는 앱의 [설정]-[프로필 수정]을 통하여 조회 및 열람이 가능합니다. 탈퇴는 앱의 [설정]-[탈퇴하기] 항목에서 신청 가능합니다. 이외에도 개인정보에 관련된 사항은 아이스크림 킨더보드 고객센터로 연락 주시면 자세한 안내를 받으실 수 있습니다.`,
          `이용자는 자신의 개인정보를 보호할 의무를 가지며, 본인의 부주의나 인터넷 상의 문제 등으로 개인정보가 유출될 경우에는 회사가 일체의 책임을 지지 않습니다.`,
          [
            `<span class="txt-bullet">▪</span>개인정보를 최신의 정보로 입력하여 불의의 사고를 예방해 주시기 바랍니다. 타인의 개인정보를 도용하여 회원가입 또는 서비스 이용 시 회원자격이 상실됩니다.`,
            `<span class="txt-bullet">▪</span>이용자는 개인정보를 보호받을 권리와 함께 스스로를 보호하고 타인의 정보를 침해하지 않을 의무를 가 지고 있습니다. PW를 포함한 개인정보가 유출되지 않도록 조심하여야 하며, 게시물을 포함한 타인의 개인정보를 훼손하지 않도록 주의하여야 합니다.`,
          ],
        ],
      ],
    },
    {
      title: '6. 개인정보 자동 수집 장치의 운영 및 그 거부에 관한 사항',
      contents: [
        [
          `쿠키의 사용 목적`,
          [
            `<span class="txt-bullet">▪</span>회사는 개인 맞춤 서비스를 제공하기 위해서 이용자에 대한 정보를 저장하고 수시로 불러오는 "쿠키(cookie)"를 사용합니다. 쿠키는 웹사이트 서버가 이용자의 브라우저에게 전송하는 소량의 정보로서 이용자 컴퓨터의 하드디스크에 저장됩니다.`,
            `<span class="txt-bullet">▪</span>회사는 회원을 식별하고 회원의 로그인 상태를 유지하기 위해 쿠키를 사용할 수 있습니다.`,
          ],
          `쿠키 설정 거부 방법`,
          [
            `<span class="txt-bullet">▪</span>이용자는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서 이용자는 웹브라우저에서 옵션을 조정함으로써 쿠키를 허용 또는 거부하거나, 쿠키가 저장될 때마다 확인을 거칠 수 있습니다.`,
            `<span class="txt-bullet">▪</span>쿠키거부(Chrome) 설정은 다음과 같습니다. [설정]-[고급 설정 표시]-[개인정보 섹션]-[사이트설정]-[콘텐츠 설정]-[쿠키설정] 단, 쿠키 저장을 거부하였을 경우 서비스 제공에 어려움이 있을 수 있습니다.`,
          ],
          `광고 식별자(ADID/IDFA) 수집 목적`,
          [
            `<span class="txt-bullet">▪</span>회사는 이용자의 ADID/IDFA를 수집할 수 있습니다. ADID(Android OS)/IDFA(iOS)란 모바일 앱 이용자의 광고 식별 값으로서,`,
            `<span class="txt-bullet">▪</span>사용자의 맞춤 서비스 제공이나 더 나은 환경의 광고를 제공하기 위한 측정을 위해 수집될 수 있습니다.`,
          ],
          `광고 식별자(ADID/IDFA) 거부 방법`,
          [
            `<span class="txt-bullet">▪</span>Android: 설정 → 개인정보보호 → 광고 → 광고 ID 재설정 또는 광고 ID 삭제`,
            `<span class="txt-bullet">▪</span>iOS: 설정 → 개인정보보호 → 추적 → 앱이 추적을 요청하도록 허용 끔<br/>※ 모바일OS 버전에 따라 메뉴 및 방법이 다소 다를 수 있습니다.`,
          ],
        ],
      ],
    },
    {
      title: '7. 개인정보의 파기',
      contents: [
        `회사는 이용자의 개인정보를 원칙적으로 고지 및 약정한 기간 동안 보유 및 이용하며 개인정보의 수집 및 이용목적이 달성되거나 이용자의 파기 요청이 있는 경우 지체 없이 파기합니다.`,
        [
          `파기절차<br />이용자가 회원가입을 위해 입력한 정보는 목적이 달성되었거나 보유 및 이용기간이 경과한 경우 내부방침 및 기타 관련법령에 의하여 해당 정보를 별도 분리하여 보관하고, 그 보관의 목적으로만 이용하며 마케팅 등 다른 목적으로 이용하지 않습니다.`,
          `파기방법<br />종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기하고 전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.`,
          `휴면회원 정책<br />회사는 회원이 5년 이상 로그인 하지 않으면, 휴면계정으로 간주하고 회원정보는 분리 보관합니다. 휴면계정으로 변경된 이후엔 회사가 제공하는 서비스를 이용할 수 없으며. 다시 서비스를 이용하려면 회사가 정하는 휴면회원 해제 절차를 이행하여야 합니다.`,
        ],
      ],
    },
    {
      title: '8. 개인정보 보호를 위한 기술적/관리적 대책',
      contents: [
        `회사는 이용자의 개인정보가 분실, 도난, 누출, 변조 또는 훼손되지 않도록 안정성 확보를 위하여 다음과 같은 기술적/관리적 대책을 강구하고 있습니다.`,
        [
          `기술적 보호조치`,
          [
            `<span class="txt-bullet">▪</span>이용자의 비밀번호는 단방향 암호화하여 저장 및 관리되고 있으며, 개인정보의 확인 및 변경은 비밀번호를 알고 있는 본인에 의해서만 가능합니다.`,
            `<span class="txt-bullet">▪</span>네트워크상의 개인정보는 안전하게 전송할 수 있도록 보안장치(SSL)을 채택하고 있습니다.`,
            `<span class="txt-bullet">▪</span>백신프로그램을 이용하여 컴퓨터바이러스에 의한 피해를 방지하기 위한 조치를 취하고 있습니다. 백신프로그램은 주기적으로 업데이트되며 갑작스런 바이러스가 출현할 경우 백신이 나오는 즉시 이를 제공함으로써 개인정보가 침해되는 것을 방지하고 있습니다.`,
            `<span class="txt-bullet">▪</span>해킹 등 외부침입에 대비하여 침입차단시스템 등을 이용하여 보안에 만전을 기하고 있습니다.`,
          ],
          `얼굴 정보와 관련된 기술적 보호조치`,
          [
            `<span class="txt-bullet">▪</span>본 앱은 사용자 사진 내 인물 분류 기능을 제공하기 위해 얼굴 이미지로부터 생성된 임베딩 데이터를 수집 및 서버에 저장할 수 있습니다. 해당 데이터는 오직 인물 식별 및 분류 기능을 위해서만 사용되며, 제3자와 공유되지 않고, 암호화되어 보관됩니다. 사용자는 언제든지 관련 데이터를 삭제하거나 처리 중단을 요청할 수 있습니다.`,
          ],
          `관리적 보호조치`,
          [
            `<span class="txt-bullet">▪</span>아이스크림 킨더보드는 이용자의 개인정보취급자를 최소한으로 제한하며, 개인정보취급자에 대한 교육 등 관리적 조치를 통해 개인정보보호의 중요성을 인식시키고 있습니다. (이용자 본인의 부주의나 인터넷상의 문제로 개인정보가 유출되어 발생한 문제에 대해 아이스크림 킨더보드는 일체의 책임을 지지 않습니다.)`,
          ],
        ],
      ],
    },
    {
      title: '9. 개인정보 관련 분쟁 조정',
      contents: [
        [
          `개인정보침해에 대한 분쟁이 있는 경우 신고나 상담을 아래 기관에 문의하시기 바랍니다.`,
          [
            `<span class="txt-bullet">▪</span>개인정보침해신고센터 (118) <a href="https://privacy.kisa.or.kr" title="개인정보침해신고센터 (118)" target="_blank">https://privacy.kisa.or.kr</a>`,
            `<span class="txt-bullet">▪</span>대검찰청 사이버범죄수사단 (1301) <a href="https://www.spo.go.kr" title="대검찰청 사이버범죄수사단 (1301)" target="_blank">https://www.spo.go.kr</a>`,
            `<span class="txt-bullet">▪</span>경찰청 사이버수사국 (182) <a href="https://ecrm.cyber.go.kr" title="경찰청 사이버수사국 (182)" target="_blank">https://ecrm.cyber.go.kr</a>`,
          ],
        ],
      ],
    },
    {
      title: '10. 개인정보 보호 책임자',
      contents: [[`성명: 소민석(아이스크림미디어 수석연구원)`, `전화번호: 1811-0910`]],
    },
    {
      title: '11. 개인정보처리방침의 개정과 고지',
      contents: [
        `법률 및 지침의 변경과 회사의 정책 변화에 따라 본 개인정보처리방침을 변경할 수 있으며 이를 개정하는 경우 시행일의 7일 전에 이를 고지 또는 통지합니다.`,
      ],
    },
    {
      contents: [`&nbsp;`, `1) 개정 일자 : 2025년 04월 04일`, `2) 시행 일자 : 2025년 04월 04일`],
    },
  ],
};

const TERMS_USE = {
  title: '아이스크림 킨더보드 이용약관',
  contentItem: [
    {
      title: '',
      contents: [
        '㈜아이스크림미디어가 제공하는 아이스크림 킨더보드 서비스(이하 "서비스")의 이용과 관련하여 회사와 회원 간의 권리, 의무 및 책임 사항 및 기타 필요한 사항을 규정함을 목적으로 합니다.',
      ],
    },
    {
      title: '제1조 (목적)',
      contents: [
        `본 약관은 ㈜아이스크림미디어(이하 '회사'라 함)가 제공하는 아이스크림 킨더보드 서비스의 이용과 관련하여 "회사"와 "회원" 사이의 권리, 의무 및 책임 사항 규정을 목적으로 합니다.`,
      ],
    },
    {
      title: '제2조 (정의)',
      contents: [
        '이 약관에서 사용하는 용어의 정의는 다음과 같습니다.',
        [
          `<span class="txt-bullet">1.</span> 서비스 : 구현되는 단말기(PC, 모바일 등의 각종 유무선 장치를 포함)와 상관없이 "회원"이 이용할 수 있는 아이스크림 킨더보드와 관련 제반 서비스를 의미합니다.`,
          `<span class="txt-bullet">2.</span> 회원 : 본 약관에 동의하고 회사가 정한 절차에 따라 회원 등록을 완료하여 서비스를 이용하는 자를 의미합니다.`,
          `<span class="txt-bullet">3.</span> 게시물 : 회원이 서비스 이용 과정에서 생성하거나 업로드한 글, 이미지, 동영상, 음성, 메모 등 각종 정보 및 자료를 말합니다.`,
          `<span class="txt-bullet">4.</span> 이용자 : 본 약관에 따라 "회사"가 제공하는 "서비스"를 이용하는 회원을 말합니다.`,
          `<span class="txt-bullet">5.</span> 회원정보 : 회사를 통해 가입을 신청한 자에게 회원가입 신청양식(이하 '신청양식')에 따라 기재를 요청하는 개인정보 및 회원의 식별과 서비스 이용을 위하여 회원이 회사에 제공한 정보를 말합니다.`,
          `<span class="txt-bullet">6.</span> 아이디(ID) : "회사"의 식별 및 "서비스" 이용을 위하여 회원가입 시 "회원"이 입력한 휴대전화번호를 의미합니다.`,
          `<span class="txt-bullet">7.</span> 비밀번호(PASSWORD) : "회원"이 입력한 휴대폰번호(ID)와 일치되는 "회원"임을 확인하고, 비밀 보호를 위해 "회원" 본인이 설정한 문자, 숫자, 특수문자의 조합을 의미합니다.`,
          `<span class="txt-bullet">8.</span> AI 기능 : 회사가 제공하는 인공지능 기술로 놀이계획안 자동 생성, 사진 분류, 사진 편집, 자료 추천 등의 기능을 말합니다.`,
          `<span class="txt-bullet">9.</span> 정의되지 않은 약관에 사용되는 용어 중 본 조에서 정하지 않은 부분은 관계법령 및 일반 관례에 따릅니다.`,
        ],
      ],
    },
    {
      title: '제3조 (약관의 게시와 개정)',
      contents: [
        [
          `<span class="txt-bullet">1.</span> "회사"는 이 약관의 내용은 "회원"이 쉽게 알 수 있도록 "서비스" 초기 화면에 게시하고 본 약관에 동의한 "회원" 모두에게 그 효력이 발생합니다.`,
          `<span class="txt-bullet">2.</span> "회사"는 필요한 경우 관련 법령을 위배하지 않는 범위 내에서 본 약관을 변경할 수 있습니다. 적용일자 및 개정내용, 개정사유 등을 명시하여 최소한 그 적용일 7일 이전부터 초기화면 및 공지사항, 팝업, 전자우편 등을 통해 고지해야 합니다. 다만, "회원"의 권리 또는 의무에 관한 중요한 규정의 변경은 30일 전에 공시하고 변경토록 합니다.`,
        ],
      ],
    },
    {
      title: '제4조 (약관적용 외 준칙)',
      contents: [
        '본 약관에 명시되지 않은 사항에 대해서는 관련 법령(정보통신망 이용촉진 및 정보보호 등에 관한 법률 시행령 등)과 관습에 따르며, 그렇지 아니한 경우에는 "회사"가 제공하는 개별 서비스 이용약관 및 운영정책에 따릅니다.',
      ],
    },
    {
      title: '제5조 (회원 가입)',
      contents: [
        [
          `<span class="txt-bullet">1.</span> "회원"으로 가입하여 "회사" 서비스의 이용을 희망하는 자는 약관의 내용을 숙지한 후 동의함을 표시하고, "회사"가 제시하는 소정의 회원가입 양식에 관련사항을 기재하여 회원가입을 신청해야 합니다.`,
          `<span class="txt-bullet">2.</span> "회사"는 전항에 따라 "회원"이 온라인 회원가입 신청양식에 기재하는 모든 회원정보를 실제 데이터인 것으로 간주합니다.`,
          `<span class="txt-bullet">3.</span> 실제 정보를 입력하지 않은 "회원"은 법적인 보호를 받을 수 없으며, 본 약관의 관련 규정에 따라 서비스 사용에 제한을 받을 수 있습니다.`,
          `<span class="txt-bullet">4.</span> "회사"는 본 조 제1항에 따른 이용자의 신청에 대하여 회원가입을 승낙함을 원칙으로 합니다. 다만, "회사"는 다음 각 호에 해당하는 신청에 대하여는 승낙을 하지 않을 수 있으며, 승낙 이후라도 취소할 수 있습니다.`,
          [
            `<span class="txt-bullet">1)</span> 이용자의 귀책사유로 인하여 승인이 불가능한 경우`,
            `<span class="txt-bullet">2)</span> 타인의 명의 또는 개인정보를 도용하는 경우`,
            `<span class="txt-bullet">3)</span> 허위의 정보를 제공하는 경우`,
            `<span class="txt-bullet">4)</span> 중복된 아이디를 사용하는 경우`,
            `<span class="txt-bullet">5)</span> 회사가 제시하는 회원가입 신청양식에 관련 내용을 기재하지 않은 경우`,
            `<span class="txt-bullet">6)</span> 이전에 회사 이용약관 또는 관계법령을 위반하여 회원자격이 상실되었던 경우`,
            `<span class="txt-bullet">7)</span> 본 약관 제 10조 (회원의 의무)를 위반하는 경우`,
            `<span class="txt-bullet">8)</span> 기타 본 약관 및 관계법령을 위반하는 경우`,
            `<span class="txt-bullet">9)</span> 회원가입 신청양식에 기재되어 회사에 제공되는 개인정보(ID, 비밀번호, 주소 등)가 선량한 풍속 기타 사회질서에 위배되거나 타인을 모욕하는 경우`,
            `<span class="txt-bullet">10)</span> 회사는 서비스 관련 설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는 경우에는 승낙을 유보할 수 있습니다`,
          ],
          `<span class="txt-bullet">5.</span> 본 조항에 따라 회원가입신청의 승낙을 하지 않거나 유보한 경우, “회사’는 원칙적으로 이를 가입신청자에게 알리도록 합니다.`,
        ],
      ],
    },
    {
      title: '제6조 (회원정보의 변경)',
      contents: [
        [
          `<span class="txt-bullet">1.</span> "회원"은 "회사"가 제공하는 아이스크림 킨더보드 서비스의 어플리케이션 또는 웹사이트 내 "마이페이지" 메뉴에 접속하여 언제든지 자신의 개인정보를 열람하고 수정할 수 있습니다.`,
          `<span class="txt-bullet">2.</span> "회원"이 전항의 변경사항을 수정하지 않아 발생한 불이익에 대하여 "회사"는 책임지지 않습니다.`,
        ],
      ],
    },
    {
      title: '제7조 (개인정보보호 의무)',
      contents: [
        [
          `<span class="txt-bullet">1.</span> "회사"는 서비스의 원활한 제공을 위하여 "회원"이 동의한 목적과 범위 내에서만 개인정보를 수집.이용하며, 개인정보 보호 관련 법령에 따라 안전하게 관리합니다. "회사"가 "회원"에 대해 관련 개인정보를 안전하게 처리하기 위하여 기울이는 노력이나 기타 상세한 사항은 개인정보 처리방침에서 확인하실 수 있습니다.`,
          `<span class="txt-bullet">2.</span> "회사"는 "회원"이 "서비스"를 이용하기 위해 일정 기간 동안 로그인 혹은 접속한 기록이 없는 경우, 전자메일, 서비스 내 알림 또는 기타 적절한 전자적 수단을 통해 사전에 안내해 드린 후 "회원"의 정보를 파기하거나 분리 보관할 수 있으며, 만약 이로 인해 "서비스" 제공을 위해 필수적인 정보가 부족해질 경우 부득이 관련 "서비스" 이용계약을 해지할 수 있습니다.`,
          `<span class="txt-bullet">3.</span> "회사"는 수사상의 목적으로 관계기관으로부터 요구 받는 경우, 기타 관계법령에 의한 경우, 회원의 사전 동의를 받은 경우에는 제3자 제공 등 예외로 처리할 수 있습니다.`,
        ],
      ],
    },
    {
      title: '제8조 (회사의 의무)',
      contents: [
        [
          `<span class="txt-bullet">1.</span> "회사"는 서비스가 안정적, 지속적으로 제공될 수 있도록 약관이 정한 바에 따라 최선의 노력을 다해야 합니다. 다만 약관에서 정한 예외의 사항은 제외될 수 있습니다.`,
          `<span class="txt-bullet">2.</span> "회사"는 서비스에 관련된 시설을 항상 운용할 수 있는 최선의 상태로 유지 보수하고 장애가 발생하는 경우 지체 없이 수리 복구할 수 있도록 최선의 노력을 다해야 합니다.`,
          `<span class="txt-bullet">3.</span> "회사"는 "회원"들의 개인정보 보호를 위하여 보안시스템을 구축하며 개인정보 처리방침을 공시하고 준수토록 합니다.`,
          `<span class="txt-bullet">4.</span> "회사"는 서비스의 제공과 관련해서 알고 있는 "회원"의 정보를 본인의 승낙 없이 제 3자에게 누설, 배포하지 않아야 합니다. 단 일부 "서비스"를 "회원"에게 제공할 목적으로 정보제공자 또는 제 3자에게 개별적으로 회원정보를 제공해야 하는 경우는 제외토록 합니다.`,
          `<span class="txt-bullet">5.</span> 사업의 인수, 매각, 양도 등의 경우는 모든 권리와 의무가 중단됩니다.`,
        ],
      ],
    },
    {
      title: '제9조 (회원의 의무)',
      contents: [
        [
          `<span class="txt-bullet">1.</span> "회원"은 약관의 규정, 이용안내, 관계법령 등 "회사"가 통지하는 사항을 준수해야 하며, 기타 "서비스" 및 "회사"의 업무에 방해가 되는 행위를 해서는 안 됩니다.`,
          `<span class="txt-bullet">2.</span> "회원"은 "회사"의 규정된 절차를 통한 사용승인 없이 "서비스"를 이용할 수 없으며 승인된 경우라도 "회원"의 상업적인 목적에 의해 "서비스"를 이용할 수 없습니다.`,
          `<span class="txt-bullet">3.</span> "회원"은 "서비스"를 통해 얻은 정보를 "회사"의 사전 동의 없이 복제, 공개, 전송, 출판, 배포, 방송, 기타 2차 저작물 등에 사용해서는 안 되며 타인에게 무단으로 제공해서도 안 됩니다.`,
          `<span class="txt-bullet">4.</span> "회원"은 개인 정보 및 기 제출한 이용신청 내용에 변경이 발생하는 경우 "회사"에 그 내용을 통보해야 합니다. 미제출 혹은 늦은 통보로 인해 발생하는 불이익은 "회원"의 책임으로 합니다.`,
          `<span class="txt-bullet">5.</span> "회원"은 "서비스" 이용과 관련하여 다음과 같은 행위를 해서는 안 됩니다.`,
          [
            `<span class="txt-bullet">1)</span> 다른 "회원"의 “아이디(ID)"를 부정 사용하는 행위`,
            `<span class="txt-bullet">2)</span> 서비스를 이용하여 범죄를 저지르는 행위`,
            `<span class="txt-bullet">3)</span> 타인의 명예를 훼손하거나 모욕하는 행위`,
            `<span class="txt-bullet">4)</span> 미풍양속 및 기타 사회질서를 해치는 행위`,
            `<span class="txt-bullet">5)</span> 해킹이나 기타 부적절한 방법으로 서비스를 침해하는 행위, 컴퓨터 바이러스 및 악성코드를 유포시키는 행위`,
            `<span class="txt-bullet">6)</span> 상업적인 목적의 광고성 정보나 내용을 지속적으로 전송하는 행위`,
            `<span class="txt-bullet">7)</span> 서비스의 안정적 운영에 지장을 주거나 기타 관계법령에 위반되는 행위`,
          ],
          `<span class="txt-bullet">6.</span> "회원"은 "아이디(ID)"와 "비밀번호(Password)"에 대한 관리책임이 있으며, 이를 타인에게 공개하여 제3자가 이용하도록 해서는 안 됩니다.`,
          [
            `<span class="txt-bullet">1)</span> "회원"은 자신의 "아이디(ID)" 및 "비밀번호(Password)"가 유출되어 제3자에 의해 사용되고 있음을 인지한 경우, 즉시 "회사"에 알려야 합니다.`,
            `<span class="txt-bullet">2)</span> "회사"는 "회원"의 개인정보 보호 및 기타 서비스 부정이용행위 방지 등을 위하여 "회원"에게 "비밀번호(Password)"의 변경 등 필요한 조치를 요구할 수 있으며, "회원"은 "회사"의 요구가 있는 즉시 성실히 응해야 합니다.`,
          ],
          `<span class="txt-bullet">7.</span> 회사와 거래하는 문자재판매사업자는 전송자격인증을 받고 전송자격인증제운영규정을 준수해야 합니다.`,
        ],
      ],
    },
    {
      title: '제10조 (서비스 제공 등)',
      contents: [
        [
          `<span class="txt-bullet">1.</span> "회사"는 "회원“에게 아이스크림 킨더보드 및 제휴 계약 등을 통해 "서비스"를 제공합니다.`,
          `<span class="txt-bullet">2.</span> "회사"는 "서비스"를 일정 범위로 분할하여 각 범위 별로 이용 가능 시간을 별도로 지정할 수 있습니다. 다만, 이러한 경우에는 그 내용을 사전에 공지합니다.`,
          `<span class="txt-bullet">3.</span> "서비스"의 이용은 특별한 경우를 제외하고는 연중무휴 1일 24시간을 원칙으로 합니다.`,
          `<span class="txt-bullet">4.</span> "회사"는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신두절 또는 운영상 상당한 이유가 있는 경우 "서비스"의 제공을 일시적으로 중단할 수 있습니다. 이러한 경우에는 "회원"에게 그 내용을 사전에 공지합니다. 다만, "회사"가 사전에 통지할 수 없는 부득이한 사유가 있는 경우 사후에 통지할 수 있습니다.`,
          `<span class="txt-bullet">5.</span> "회사"는 "서비스"의 제공에 필요한 경우 정기점검을 실시할 수 있으며, 정기점검시간은 "서비스" 제공화면에 공지한 바에 따릅니다.`,
        ],
      ],
    },
    {
      title: '제11조 (서비스의 변경) ',
      contents: [
        [
          `<span class="txt-bullet">1.</span> "서비스" 내용의 추가, 변경 또는 삭제되는 경우에는 이에 관한 내용을 회사가 사전, 사후 공지를 통해 알리도록 합니다.`,
          `<span class="txt-bullet">2.</span> "회사"가 제공하는 "서비스"의 일부 또는 전부를 "회사"의 정책 및 운영의 필요상 수정, 중단, 변경할 수 있으며, 이에 대하여 관련 법령에 특별한 규정이 없는 한 회원에게 별도의 보상을 하지 않습니다.`,
        ],
      ],
    },
    {
      title: '제12조 (정보의 제공 및 광고의 게재)',
      contents: [
        [
          `<span class="txt-bullet">1.</span> "회사"는 "서비스" 운용과 관련하여 "서비스" 내에 광고를 게재할 수 있습니다.`,
          `<span class="txt-bullet">2.</span> "회사"는 광고와 관련하여 "회원"의 개인정보에 관해 통계 및 수치화 된 데이터를 작성하고 이를 활용할 수 있습니다.`,
          `<span class="txt-bullet">3.</span> "회사"는 "서비스" 상에 게재된 광고주의 판촉활동에 회원이 참여하거나 교신 또는 거래의 결과로서 발생하는 모든 손실과 손해에 대해 책임을 지지 않으며, 이에 대한 통제력이 없습니다.`,
          [
            `<span class="txt-bullet">1)</span> "회사"의 "서비스"에는 제3자의 서비스(웹 사이트 등)로 연결되는 하이퍼링크가 포함될 수 있습니다.`,
            `<span class="txt-bullet">2)</span> "회원"은 제3자가 제공하는 서비스, 물품 등을 구매하거나 사용할수 있습니다. 이러한 기타 서비스, 물품의 사용에는 고객과 해당 제3자 간의 별도 이용 약관이 적용될 수 있습니다.`,
          ],
          `<span class="txt-bullet">4.</span> "회사"는 "서비스" 운용과 관련하여 각종 정보를 게재하여 "회원"에게 전달, 혹은 제공할 수 있습니다.`,
          `<span class="txt-bullet">5.</span> 전송자격인증제에 따른 인증(이하 ‘전송 자격인증’)을 받지 않거나, 인증이 취소된 사업자와는 거래를 하지 아니할 수 있다.`,
          `<span class="txt-bullet">6.</span> 회사와 거래하는 문자재판매사업자는 전송자격인증을 받고 전송자격인증제 운영규정을 준수해야 한다.`,
        ],
      ],
    },
    {
      title: '제13조 (게시물의 저작권)',
      contents: [
        [
          `<span class="txt-bullet">1.</span> "회원"이 "서비스" 내에 게재하거나 등록한 "게시물"의 저작권 및 지적재산권은 "회원"에게 있으며, "회사"는 "서비스"상의 게재권만을 갖습니다.`,
          `<span class="txt-bullet">2.</span> "게시물"은 제3자의 소유권 또는 지식 재산권에 의해 보호될 수 있습니다. "회원"은 “게시물”(전체 또는 일부)을 복제, 전송, 전시, 공연, 출판, 방송, 배포, 2차 저작행위, 기타 영리목적으로 이용하거나 제 3자에게 무단으로 제공해서는 안 됩니다.`,
          `<span class="txt-bullet">3.</span> "회사"가 작성한 게시물에 대한 저작권 및 지적재산권, 전송권, 2차 저작권 등은 모두 "회사"에 귀속됩니다.`,
          `<span class="txt-bullet">4.</span> "회원"은 저작권 및 지적재산권을 가진 자료를 비영리 목적으로 사용하고자 하는 경우, "회사"의 사전 승인을 받아야 합니다.`,
        ],
      ],
    },
    {
      title: '제14조 (게시물의 관리) ',
      contents: [
        [
          `<span class="txt-bullet">1.</span> 게시물에 대한 저작권 등 관리 책임은 이를 게시한 "회원"에게 있습니다.`,
          `<span class="txt-bullet">2.</span> "회사"는 "회원"이 "서비스"에 게시·게재하거나 "서비스"를 통해 전송, 배포한 자료에 대해서는 책임을 지지 않습니다.`,
          `<span class="txt-bullet">3.</span> 다음과 같은 경우 "회사"는 사전통지 혹은 사전통지 없이 "회원"의 게시물을 삭제할 수 있습니다.`,
          [
            `<span class="txt-bullet">1)</span> "회사"의 저작권 및 지적재산권, 제 3자의 저작권 및 지적재산권 등을 침해하는 내용의 게시물`,
            `<span class="txt-bullet">2)</span> 공공질서 및 미풍양속을 해하는 내용의 게시물`,
            `<span class="txt-bullet">3)</span> 다른 "회원" 또는 제3자를 비방하거나 명예를 훼손시키는 내용의 게시물`,
            `<span class="txt-bullet">4)</span> 범죄목적에 부합되는 내용의 게시물`,
            `<span class="txt-bullet">5)</span> 음란물을 게재하거나 음란사이트를 링크하는 경우`,
            `<span class="txt-bullet">6)</span> 게시판 성격에 위배되는 게시물 혹은 기타 관계법령에 위반되는 내용의 게시물`,
            `<span class="txt-bullet">7)</span> 기타 회사가 필요하다고 인정되는 경우`,
          ],
        ],
      ],
    },
    {
      title: '제15조 (권리의 귀속)',
      contents: [
        [
          `<span class="txt-bullet">1.</span> "서비스" 이용에 따른 저작권 및 지적재산권은 회사에 귀속됩니다. 단, "회원"의 게시물 및 제휴계약에 따라 제공된 저작물 등은 제외합니다`,
          `<span class="txt-bullet">2.</span>  "회원"은 "서비스"를 이용함으로써 얻은 정보를 회사의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송 등 기타 방법에 의하여 이용하거나 제3자에게 이용하게 하여서는 안 됩니다.`,
        ],
      ],
    },
    {
      title: '제16조 (회원 탈퇴 및 이용 제한)',
      contents: [
        [
          `<span class="txt-bullet">1.</span> "회원"은 언제든지 "회사"를 통하여 탈퇴 신청을 할 수 있으며, "회사"는 관련법 등이 정하는 바에 따라 이를 지체없이 처리 합니다. `,
          `<span class="txt-bullet">2.</span> "회사"는 "회원"이 제 9조(회원의 의무)에 언급된 약관의 내용을 위반하고 "회사"의 시정권고에도 불구하고 이에 응하지 않는 경우 회원 탈퇴 및 이용 중인 "서비스"를 해지할 수 있습니다.`,
          `<span class="txt-bullet">3.</span> "회사"는 본 조 제 2항에 의해 해지된 "회원"이 회원가입을 하는 경우 그 승인을 제한할 수 있으며, "회사" 내부의 방침 의해 회원가입 제한 기간을 정할 수 있습니다.`,
        ],
      ],
    },
    {
      title: '제17조 (손해배상)',
      contents: [
        [
          `<span class="txt-bullet">1.</span> "회사"는 "회원"이 "서비스"를 이용함에 있어 "회사"의 고의 또는 과실로 인하여 손해를 입게 될 경우 관련 법령에 따라 손해를 배상합니다. 다만, 천재지변 또는 이에 준하는 불가항력으로 인하여 "회사"가 "서비스"를 제공할 수 없거나 "회원"의 고의 또는 과실로 인하여 "서비스"를 이용할 수 없어 발생한 손해에 대해서 "회사"는 책임을 부담하지 않습니다.`,
          `<span class="txt-bullet">2.</span> "회사"가 손해배상책임을 부담하는 경우에도 통상적으로 예견이 불가능하거나 특별한 사정으로 인한 특별 손해 또는 간접 손해, 기타 징벌적 손해에 대해서는 관련 법령에 특별한 규정이 없는 한 책임을 부담하지 않습니다.`,
        ],
      ],
    },
    {
      title: '제18조 (면책)',
      contents: [
        [
          `<span class="txt-bullet">1.</span> "회사"는 "회원"이 "서비스"에 게재한 "게시물"(자료, 정보 등)의 내용에 관해서는 책임이 없으며, "회원"이 게재한 “게시물”로 인해 발생되는 손해 및 불이익에 대한 책임을 부담하지 않습니다.`,
          `<span class="txt-bullet">2.</span> "회사"는 "회원"이 "서비스" 중 AI 기능을 통해 생성한 결과물의 정확성, 신뢰성, 완전성에 대한 책임이 없으며, 이를 보증하지 않습니다.`,
          `<span class="txt-bullet">3.</span> "회원"이 서비스에 14세 미만 아동의 개인정보(예: 이름, 생년월일, 사진 등)를 입력하거나 업로드하는 경우, 해당 아동의 법정대리인(보호자)으로부터 개인정보 수집 및 이용에 대한 사전 동의를 받아야 하며, 이에 대한 책임은 전적으로 해당 "회원"에게 있습니다. "회사"는 "회원"이 정당한 동의 없이 아동 정보를 입력하거나 이용하여 발생하는 민·형사상 분쟁, 손해, 법적 책임 등에 대해 어떠한 책임도 부담하지 않습니다.`,
          `<span class="txt-bullet">4.</span> "회사"는 "회사"의 승인이나 동의 없이 "회원"간 또는 "회원"과 제3자간에 발생하는 물품거래 및 상행위 등과 관련하여 어떠한 책임도 부담하지 않습니다.`,
          `<span class="txt-bullet">5.</span> "회원"이 본 약관이 규정하는 내용을 위반하여 "회사" 또는 타 "회원", 제 3자에게 손해가 발생하는 경우, 본 약관을 위반한 "회원"에게 배상의 책임이 있습니다.`,
        ],
      ],
    },
    {
      title: '제19조 (재판권 및 준거법) ',
      contents: [
        [
          `<span class="txt-bullet">1.</span> "회사"와 "회원"은 "서비스"와 관련하여 발생한 분쟁을 원만하게 해결하도록 모든 노력을 다해야 합니다.`,
          `<span class="txt-bullet">2.</span> "회사"와 "회원" 간에 발생한 분쟁에 관한 소송은 "회사"의 본사 소재지 관할 법원에서 진행합니다. 다만, "회원"의 요청에 의해 “회원"의 주소지를 관할하는 지방법원에서 진행 할 수 있습니다.`,
          `<span class="txt-bullet">3.</span> "회사"와 "회원"간에 제기된 소송은 대한민국 법을 적용합니다.`,
        ],
      ],
    },
    {
      contents: [`[부칙] 이 약관은 2025년 4월 4일부터 시행합니다.`],
    },
  ],
};

export { TERMS_PRIVACY, TERMS_USE };
